'''
Prgram 명: D-day.py
Author: jeongmin Kang
Mail: jarvisNim@gmail.com
그 날이 오는 확률 분석하는 기능 제공
- 자산 인플레이션, 그 선을 찾다.

  . 결국 자산인플레이션의 마지노 선은,
    가능한 최대로 극대화된 레버리지 투기가 결국 키스톤이 깨지며 도미노처럼 우수수 무너지는 순간임. 
    이를 위해 두 가지 필요조건이 있는데,
    하나는 레버리지가 극대화되어 있어야 하며,
    둘째는 키스톤이 깨졌을때 도미노 현상으로 수습 불가능한 상태가 되어야함.
    이 두 개의 필요조건이 현대 투자기법에서 과연 가능할 것이가? 

  . 현실적으로 그 날이 올수 있는 확률의 매우 희박하다고 결론짓는 것이 타당하지 않을까 ?
    왜냐하면, 수 백년간의 쓰라린 경험과 실시간 정보유통으로 time gap 이 없는 현재 사회에서 
    그리고 중앙은행의 무제한 현금투입으로 다시 회생시킬 수 있는 막강한 파워마저 존재하는 현 상황에서 과연 그 날이 올수 있을까 ?

  . 회색 코끼리, 그 또한 조치가능한 것 아닐까? 예를들어 대한민국의 인구감소율이 소멸수준이라하더라도 과연 사라질까 ?
    그 날이 온다는 공포가 생기게되면 결국 해결책 아니면 대안이라도 나오지 않을까 ?

  . 결론은,
    막대한 레버리지 투기가 성행하는 상황에서 예상하지 않은 곳에서 상당한 규모의 폭발력을 지닌 이벤트가 생겨야만 가능함.
    코로나19 처럼.

  . 경제 vs 금융 => ( real GDP growth vs Asset growth ) * Dollar Volume
  
'''